import unittest
from lab05 import gen_bin_tree_nonrecursive

class TestGenBinTree(unittest.TestCase):
    def test_height_0(self):
        # Тест для высоты 0
        tree = gen_bin_tree_nonrecursive(0, 1)
        self.assertEqual(tree, {"1": []})

    def test_height_1(self):
        # Тест для высоты 1
        tree = gen_bin_tree_nonrecursive(1, 1)
        self.assertEqual(tree, {"1": [{"2": []}, {"4": []}]})

    def test_height_2(self):
        # Тест для высоты 2
        tree = gen_bin_tree_nonrecursive(2, 1)
        self.assertEqual(tree, {"1": [{"2": [{"4": []}, {"5": []}]},
                                      {"4": [{"8": []}, {"7": []}]}]})
    def test_height_3(self):
        # Тест для высоты 3
        tree = gen_bin_tree_nonrecursive(3, 1)
        self.assertEqual(tree, {"1": [{"2": [
                                          {"4": [{"8": []}, {"7": []}]},
                                          {"5": [{"10": []}, {"8": []}]}]},
                                      {"4": [
                                          {"8": [{"16": []}, {"11": []}]},
                                          {"7": [{"14": []}, {"10": []}]}]}]})
    def test_height_4(self):
        # Тест для высоты 4
        tree = gen_bin_tree_nonrecursive(4, 1)
        self.assertEqual(tree, {"1": [{"2": [
                                        {"4": [
                                            {"8": [{"16": []}, {"11": []}]},
                                            {"7": [{"14": []}, {"10": []}]}]},
                                        {"5": [
                                            {"10": [{"20": []}, {"13": []}]},
                                            {"8": [{"16": []}, {"11": []}]}]}]},
                                      {"4": [
                                        {"8": [
                                            {"16": [{"32": []}, {"19": []}]},
                                            {"11": [{"22": []}, {"14": []}]}]},
                                        {"7": [
                                         {"14": [{"28": []}, {"17": []}]},
                                         {"10": [{"20": []}, {"13": []}]}]}]}]})
    def test_height_5_(self):
        # Тест для высоты 5
        tree = gen_bin_tree_nonrecursive(5, 1)
        self.assertEqual(tree, {"1": [
                                {"2": [
                                  {"4": [
                                    {"8": [
                                      {"16": [{"32": []}, {"19": []}]},
                                      {"11": [{"22": []}, {"14": []}]}]},
                                    {"7": [
                                      {"14": [{"28": []}, {"17": []}]},
                                      {"10": [{"20": []}, {"13": []}]}]}]},
                                  {"5": [
                                    {"10": [
                                      {"20": [{"40": []}, {"23": []}]},
                                      {"13": [{"26": []}, {"16": []}]}]},
                                    {"8": [
                                      {"16": [{"32": []}, {"19": []}]},
                                      {"11": [{"22": []}, {"14": []}]}]}]}]},
                                {"4": [
                                  {"8": [
                                    {"16": [
                                      {"32": [{"64": []}, {"35": []}]},
                                      {"19": [{"38": []}, {"22": []}]}]},
                                    {"11": [
                                      {"22": [{"44": []}, {"25": []}]},
                                      {"14": [{"28": []}, {"17": []}]}]}]},
                                  {"7": [
                                    {"14": [
                                      {"28": [{"56": []}, {"31": []}]},
                                      {"17": [{"34": []}, {"20": []}]}]},
                                    {"10": [
                                      {"20": [{"40": []}, {"23": []}]},
                                      {"13": [{"26": []}, {"16": []}]}]}]}]}]})



if __name__ == '__main__':
    unittest.main(argv=[''], verbosity=2, exit=False)
